# Userモデルの初期データ（管理ユーザー）
User.create!(
  name: "管理ユーザー",
  admin: true,
  email: "#{ENV['ADMIN_USER_EMAIL']}",
  password: "#{ENV['ADMIN_USER_PASSWORD']}",
  confirmed_at: Time.now
)

# Categoryモデルのデータ
categories = [
  [
    "おまとめ",
    "おまとめ"
  ],
  [
    "主食類",
    "おこめ・ぱん"
  ],
  [
    "麺類",
    "めん"
  ],
  [
    "野菜",
    "やさい"
  ],
  [
    "生野菜",
    "なまやさい"
  ],
  [
    "キノコ類",
    "きのこ"
  ],
  [
    "果物",
    "くだもの"
  ],
  [
    "肉",
    "にく"
  ],
  [
    "海産物",
    "かいさんぶつ"
  ],
  [
    "卵",
    "たまご"
  ],
  [
    "乳製品",
    "にゅうせいひん"
  ],
  [
    "大豆製品",
    "だいず"
  ],
  [
    "粉製品",
    "こな"
  ],
  [
    "調味料",
    "ちょうみりょう"
  ],
  [
    "油",
    "あぶら"
  ],
  [
    "甘い物",
    "あまいもの"
  ],
  [
    "飲み物",
    "のみもの"
  ],
  [
    "お風呂用品",
    "おふろ"
  ],
  [
    "歯磨き用品",
    "はみがき"
  ],
  [
    "コスメ",
    "けしょうひん"
  ],
  [
    "洗濯用品",
    "せんたく"
  ],
  [
    "キッチン用品",
    "だいどころ"
  ],
  [
    "ペーパー類",
    "ちりがみ"
  ],
  [
    "ペット用品",
    "ぺっと"
  ],
  [
    "その他",
    "そのほか"
  ]
]

categories.each do |name, hiragana|
  Category.create!(name: name, hiragana: hiragana)
end

# Itemモデルの初期データ
items = [
  [ 1, 1, "ご飯のおかず", "ごはんのおかず" ],
  [ 1, 1, "野菜", "やさい" ],
  [ 1, 1, "果物", "くだもの" ],
  [ 1, 1, "肉", "にく" ],
  [ 1, 1, "魚介", "ぎょかい" ],
  [ 1, 1, "お惣菜", "おそうざい" ],
  [ 1, 1, "食用油", "しょくようあぶら" ],
  [ 1, 1, "冷凍食品", "れいとうしょくひん" ],
  [ 1, 1, "インスタント", "いんすたんと" ],
  [ 1, 1, "薬", "くすり" ],
  [ 1, 1, "サプリメント", "さぷりめんと" ],
  [ 1, 1, "お菓子", "おかし" ],
  [ 1, 1, "洋菓子", "ようがし" ],
  [ 1, 1, "和菓子", "わがし" ],
  [ 1, 2, "お米", "おこめ" ],
  [ 1, 2, "パン", "ぱん" ],
  [ 1, 3, "うどん", "うどん" ],
  [ 1, 3, "素麺", "そうめん" ],
  [ 1, 3, "蕎麦", "そば" ],
  [ 1, 3, "ラーメン", "らーめん" ],
  [ 1, 3, "焼きそば", "やきそば" ],
  [ 1, 3, "パスタ", "ぱすた" ],
  [ 1, 4, "カブ", "かぶ" ],
  [ 1, 4, "キャベツ", "きゃべつ" ],
  [ 1, 4, "ごぼう", "ごぼう" ],
  [ 1, 4, "さつま芋", "さつまいも" ],
  [ 1, 4, "里芋", "さといも" ],
  [ 1, 4, "じゃが芋", "じゃがいも" ],
  [ 1, 4, "生姜", "しょうが" ],
  [ 1, 4, "大根", "だいこん" ],
  [ 1, 4, "玉ねぎ", "たまねぎ" ],
  [ 1, 4, "長芋", "ながいも" ],
  [ 1, 4, "長ネギ", "ながねぎ" ],
  [ 1, 4, "ナス", "なす" ],
  [ 1, 4, "人参", "にんじん" ],
  [ 1, 4, "ニンニク", "にんにく" ],
  [ 1, 4, "白菜", "はくさい" ],
  [ 1, 4, "ピーマン", "ぴーまん" ],
  [ 1, 4, "もやし", "もやし" ],
  [ 1, 4, "レンコン", "れんこん" ],
  [ 1, 5, "きゅうり", "きゅうり" ],
  [ 1, 5, "トマト", "とまと" ],
  [ 1, 5, "レタス", "れたす" ],
  [ 1, 6, "エノキ", "えのき" ],
  [ 1, 6, "エリンギ", "えりんぎ" ],
  [ 1, 6, "椎茸", "しいたけ" ],
  [ 1, 6, "しめじ", "しめじ" ],
  [ 1, 6, "舞茸", "まいたけ" ],
  [ 1, 7, "イチゴ", "いちご" ],
  [ 1, 7, "オレンジ", "おれんじ" ],
  [ 1, 7, "キウイ", "きうい" ],
  [ 1, 7, "グレープフルーツ", "ぐれーぷふるーつ" ],
  [ 1, 7, "梨", "なし" ],
  [ 1, 7, "バナナ", "ばなな" ],
  [ 1, 7, "ぶどう", "ぶどう" ],
  [ 1, 7, "みかん", "みかん" ],
  [ 1, 7, "メロン", "めろん" ],
  [ 1, 7, "桃", "もも" ],
  [ 1, 7, "リンゴ", "りんご" ],
  [ 1, 7, "レモン", "れもん" ],
  [ 1, 8, "ウインナー", "ういんなー" ],
  [ 1, 8, "牛肉", "ぎゅうにく" ],
  [ 1, 8, "牛ひき肉", "ぎゅうひきにく" ],
  [ 1, 8, "鶏肉", "とりにく" ],
  [ 1, 8, "鶏ひき肉", "とりひきにく" ],
  [ 1, 8, "ハム", "はむ" ],
  [ 1, 8, "豚肉", "ぶたにく" ],
  [ 1, 8, "豚ひき肉", "ぶたひきにく" ],
  [ 1, 8, "ベーコン", "べーこん" ],
  [ 1, 9, "イカ", "いか" ],
  [ 1, 9, "エビ", "えび" ],
  [ 1, 9, "お刺し身", "おさしみ" ],
  [ 1, 9, "貝", "かい" ],
  [ 1, 9, "昆布", "こんぶ" ],
  [ 1, 9, "魚の干物", "さかなのひもの" ],
  [ 1, 9, "タコ", "たこ" ],
  [ 1, 9, "生魚", "なまざかな" ],
  [ 1, 9, "ワカメ", "わかめ" ],
  [ 1, 10, "温泉卵", "おんせんたまご" ],
  [ 1, 10, "生卵", "なまたまご" ],
  [ 1, 11, "牛乳", "ぎゅうにゅう" ],
  [ 1, 11, "バター", "ばたー" ],
  [ 1, 11, "マーガリン", "まーがりん" ],
  [ 1, 11, "ヨーグルト", "よーぐると" ],
  [ 1, 12, "油揚げ", "あぶらあげ" ],
  [ 1, 12, "豆腐", "とうふ" ],
  [ 1, 12, "納豆", "なっとう" ],
  [ 1, 13, "小麦粉", "こむぎこ" ],
  [ 1, 13, "片栗粉", "かたくりこ" ],
  [ 1, 14, "お酢", "おす" ],
  [ 1, 14, "カレー粉", "かれーこ" ],
  [ 1, 14, "ケチャップ", "けちゃっぷ" ],
  [ 1, 14, "コショウ", "こしょう" ],
  [ 1, 14, "砂糖", "さとう" ],
  [ 1, 14, "塩", "しお" ],
  [ 1, 14, "しょうゆ", "しょうゆ" ],
  [ 1, 14, "ソース", "そーす" ],
  [ 1, 14, "マヨネーズ", "まよねーず" ],
  [ 1, 14, "味噌", "みそ" ],
  [ 1, 14, "みりん", "みりん" ],
  [ 1, 14, "料理酒", "りょうりしゅ" ],
  [ 1, 14, "わさび", "わさび" ],
  [ 1, 15, "オリーブオイル", "おりーぶおいる" ],
  [ 1, 15, "ごま油", "ごまあぶら" ],
  [ 1, 15, "こめ油", "こめあぶら" ],
  [ 1, 15, "サラダ油", "さらだあぶら" ],
  [ 1, 15, "ドレッシング", "どれっしんぐ" ],
  [ 1, 16, "飴", "あめ" ],
  [ 1, 16, "菓子パン", "かしぱん" ],
  [ 1, 16, "カステラ", "かすてら" ],
  [ 1, 16, "ケーキ", "けーき" ],
  [ 1, 16, "チョコレート", "ちょこれーと" ],
  [ 1, 16, "たい焼き", "たいやき" ],
  [ 1, 16, "大福", "だいふく" ],
  [ 1, 16, "団子", "だんご" ],
  [ 1, 16, "どら焼き", "どらやき" ],
  [ 1, 16, "プリン", "ぷりん" ],
  [ 1, 17, "お酒", "おさけ" ],
  [ 1, 17, "お茶", "おちゃ" ],
  [ 1, 17, "ジュース", "じゅーす" ],
  [ 1, 17, "水", "みず" ],
  [ 1, 18, "シャンプー", "しゃんぷー" ],
  [ 1, 18, "石鹸", "せっけん" ],
  [ 1, 18, "洗顔料", "せんがんりょう" ],
  [ 1, 18, "ボディソープ", "ぼでぃそーぷ" ],
  [ 1, 18, "ボディタオル", "ぼでぃたおる" ],
  [ 1, 18, "リンス", "りんす" ],
  [ 1, 19, "歯ブラシ", "はぶらし" ],
  [ 1, 19, "歯磨き粉", "はみがきこ" ],
  [ 1, 20, "口紅", "くちべに" ],
  [ 1, 20, "クレンジング", "くれんじんぐ" ],
  [ 1, 20, "化粧水", "けしょうすい" ],
  [ 1, 20, "ファンデーション", "ふぁんでーしょん" ],
  [ 1, 21, "柔軟剤", "じゅうなんざい" ],
  [ 1, 21, "洗濯洗剤", "せんたくせんざい" ],
  [ 1, 21, "漂白剤", "ひょうはくざい" ],
  [ 1, 22, "アルミホイル", "あるみほいる" ],
  [ 1, 22, "キッチン洗剤", "きっちんせんざい" ],
  [ 1, 22, "スポンジ", "すぽんじ" ],
  [ 1, 22, "ラップ", "らっぷ" ],
  [ 1, 23, "ウェットティッシュ", "うぇっとてぃっしゅ" ],
  [ 1, 23, "キッチンペーパー", "きっちんぺーぱー" ],
  [ 1, 23, "ティッシュ", "てぃっしゅ" ],
  [ 1, 23, "トイレットペーパー", "といれっとぺーぱー" ],
  [ 1, 24, "エサ", "えさ" ],
  [ 1, 24, "トイレ砂", "といれすな" ]
]

items.each do |user_id, category_id, name, hiragana|
  Item.create!(user_id: user_id, category_id: category_id, name: name, hiragana: hiragana)
end
